OF4.0/tutorials/oscillatorySheetFlow/constant/initial_profiles/psf.xy
(
(0 981.090865)
(0.0005 976.162084)
(0.001 971.233409)
(0.0015 966.304841)
(0.002 961.37638)
(0.0025 956.448028)
(0.003 951.519784)
(0.0035 946.591649)
(0.004 941.662985)
(0.0045 936.73514)
(0.005 931.8074)
(0.0055 926.879768)
(0.006 921.952243)
(0.0065 917.024827)
(0.007 912.097521)
(0.0075 907.170324)
(0.008 902.243239)
(0.0085 897.316266)
(0.009 892.389405)
(0.0095 887.462659)
(0.01 882.536027)
(0.0105 877.609512)
(0.011 872.683112)
(0.0115 867.756831)
(0.012 862.830667)
(0.0125 857.904624)
(0.013 852.978701)
(0.0135 848.052899)
(0.014 843.12722)
(0.0145 838.201664)
(0.015 833.276233)
(0.0155 828.350927)
(0.016 823.426196)
(0.0165 818.50084)
(0.017 813.57577)
(0.0175 808.650581)
(0.018 803.725927)
(0.0185 798.801405)
(0.019 793.877016)
(0.0195 788.95276)
(0.02 784.028638)
(0.0205 779.104651)
(0.021 774.180801)
(0.0215 769.257088)
(0.022 764.333512)
(0.0225 759.410076)
(0.023 754.48678)
(0.0235 749.563625)
(0.024 744.640612)
(0.0245 739.717742)
(0.025 734.795017)
(0.0255 729.872436)
(0.026 724.950003)
(0.0265 720.027716)
(0.027 715.105579)
(0.0275 710.183591)
(0.028 705.261754)
(0.0285 700.340069)
(0.029 695.418537)
(0.0295 690.49716)
(0.03 685.575939)
(0.0305 680.654874)
(0.031 675.733968)
(0.0315 670.813221)
(0.032 665.892635)
(0.0325 660.972211)
(0.033 656.05195)
(0.0335 651.131854)
(0.034 646.211925)
(0.0345 641.292163)
(0.035 636.37257)
(0.0355 631.453147)
(0.036 626.533897)
(0.0365 621.61482)
(0.037 616.695917)
(0.0375 611.777192)
(0.038 606.858644)
(0.0385 601.940276)
(0.039 597.022089)
(0.0395 592.104085)
(0.04 587.186266)
(0.0405 582.268633)
(0.041 577.351189)
(0.0415 572.433934)
(0.042 567.516871)
(0.0425 562.600001)
(0.043 557.683326)
(0.0435 552.766849)
(0.044 547.850571)
(0.0445 542.934495)
(0.045 538.018621)
(0.0455 533.102953)
(0.046 528.187492)
(0.0465 523.27224)
(0.047 518.357201)
(0.0475 513.442375)
(0.048 508.527765)
(0.0485 503.613373)
(0.049 498.699203)
...
)
