OF4.0/tutorials/oscillatorySheetFlow/constant/initial_profiles/sand.xy
(
(0 0.606117)
(0.0005 0.606102)
(0.001 0.606088)
(0.0015 0.606073)
(0.002 0.606058)
(0.0025 0.606044)
(0.003 0.606029)
(0.0035 0.606014)
(0.004 0.605999)
(0.0045 0.605983)
(0.005 0.605968)
(0.0055 0.605953)
(0.006 0.605937)
(0.0065 0.605922)
(0.007 0.605906)
(0.0075 0.605891)
(0.008 0.605875)
(0.0085 0.605859)
(0.009 0.605843)
(0.0095 0.605827)
(0.01 0.605811)
(0.0105 0.605795)
(0.011 0.605778)
(0.0115 0.605762)
(0.012 0.605745)
(0.0125 0.605729)
(0.013 0.605712)
(0.0135 0.605695)
(0.014 0.605678)
(0.0145 0.605661)
(0.015 0.605644)
(0.0155 0.605626)
(0.016 0.605609)
(0.0165 0.605591)
(0.017 0.605574)
(0.0175 0.605556)
(0.018 0.605538)
(0.0185 0.60552)
(0.019 0.605502)
(0.0195 0.605484)
(0.02 0.605465)
(0.0205 0.605447)
(0.021 0.605428)
(0.0215 0.605409)
(0.022 0.60539)
(0.0225 0.605371)
(0.023 0.605352)
(0.0235 0.605333)
(0.024 0.605313)
(0.0245 0.605294)
(0.025 0.605274)
(0.0255 0.605254)
(0.026 0.605234)
(0.0265 0.605214)
(0.027 0.605194)
(0.0275 0.605173)
(0.028 0.605153)
(0.0285 0.605132)
(0.029 0.605111)
(0.0295 0.60509)
(0.03 0.605069)
(0.0305 0.605047)
(0.031 0.605026)
(0.0315 0.605004)
(0.032 0.604982)
(0.0325 0.60496)
(0.033 0.604938)
(0.0335 0.604915)
(0.034 0.604892)
(0.0345 0.60487)
(0.035 0.604847)
(0.0355 0.604823)
(0.036 0.6048)
(0.0365 0.604776)
(0.037 0.604752)
(0.0375 0.604728)
(0.038 0.604704)
(0.0385 0.60468)
(0.039 0.604655)
(0.0395 0.60463)
(0.04 0.604605)
(0.0405 0.60458)
(0.041 0.604554)
(0.0415 0.604528)
(0.042 0.604502)
(0.0425 0.604476)
(0.043 0.604449)
(0.0435 0.604423)
(0.044 0.604395)
(0.0445 0.604368)
(0.045 0.604341)
(0.0455 0.604313)
(0.046 0.604285)
(0.0465 0.604256)
(0.047 0.604227)
(0.0475 0.604198)
(0.048 0.604169)
(0.0485 0.604139)
(0.049 0.604109)
...
)
