OF4.0/tutorials/oscillatorySheetFlow/constant/initial_profiles/water.xy
(
(0 0.393883)
(0.0005 0.393898)
(0.001 0.393912)
(0.0015 0.393927)
(0.002 0.393942)
(0.0025 0.393956)
(0.003 0.393971)
(0.0035 0.393986)
(0.004 0.394001)
(0.0045 0.394017)
(0.005 0.394032)
(0.0055 0.394047)
(0.006 0.394063)
(0.0065 0.394078)
(0.007 0.394094)
(0.0075 0.394109)
(0.008 0.394125)
(0.0085 0.394141)
(0.009 0.394157)
(0.0095 0.394173)
(0.01 0.394189)
(0.0105 0.394205)
(0.011 0.394222)
(0.0115 0.394238)
(0.012 0.394255)
(0.0125 0.394271)
(0.013 0.394288)
(0.0135 0.394305)
(0.014 0.394322)
(0.0145 0.394339)
(0.015 0.394356)
(0.0155 0.394374)
(0.016 0.394391)
(0.0165 0.394409)
(0.017 0.394426)
(0.0175 0.394444)
(0.018 0.394462)
(0.0185 0.39448)
(0.019 0.394498)
(0.0195 0.394516)
(0.02 0.394535)
(0.0205 0.394553)
(0.021 0.394572)
(0.0215 0.394591)
(0.022 0.39461)
(0.0225 0.394629)
(0.023 0.394648)
(0.0235 0.394667)
(0.024 0.394687)
(0.0245 0.394706)
(0.025 0.394726)
(0.0255 0.394746)
(0.026 0.394766)
(0.0265 0.394786)
(0.027 0.394806)
(0.0275 0.394827)
(0.028 0.394847)
(0.0285 0.394868)
(0.029 0.394889)
(0.0295 0.39491)
(0.03 0.394931)
(0.0305 0.394953)
(0.031 0.394974)
(0.0315 0.394996)
(0.032 0.395018)
(0.0325 0.39504)
(0.033 0.395062)
(0.0335 0.395085)
(0.034 0.395108)
(0.0345 0.39513)
(0.035 0.395153)
(0.0355 0.395177)
(0.036 0.3952)
(0.0365 0.395224)
(0.037 0.395248)
(0.0375 0.395272)
(0.038 0.395296)
(0.0385 0.39532)
(0.039 0.395345)
(0.0395 0.39537)
(0.04 0.395395)
(0.0405 0.39542)
(0.041 0.395446)
(0.0415 0.395472)
(0.042 0.395498)
(0.0425 0.395524)
(0.043 0.395551)
(0.0435 0.395577)
(0.044 0.395605)
(0.0445 0.395632)
(0.045 0.395659)
(0.0455 0.395687)
(0.046 0.395715)
(0.0465 0.395744)
(0.047 0.395773)
(0.0475 0.395802)
(0.048 0.395831)
(0.0485 0.395861)
(0.049 0.395891)
...
)
