OF4.0/tutorials/oscillatorySheetFlow/0.org/gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
360
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inandouthalf11
    {
        type            cyclic;
    }
    inandouthalf12
    {
        type            cyclic;
    }
    inandouthalf21
    {
        type            cyclic;
    }
    inandouthalf22
    {
        type            cyclic;
    }
    inandouthalf31
    {
        type            cyclic;
    }
    inandouthalf32
    {
        type            cyclic;
    }
    inandouthalf41
    {
        type            cyclic;
    }
    inandouthalf42
    {
        type            cyclic;
    }
    top
    {
        type            symmetryPlane;
    }
    walls
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
