OF4.0/tutorials/oscillatorySheetFlow/system/sampleProbeAlpha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;
 
	libs ("libsampling.so");

	interpolationScheme cellPointFace; 

	setFormat       gnuplot;

fields
(
	alpha.sand
);

probeLocations	( 
					( 0.001 0.09855 0)
					( 0.001 0.09915 0)
					( 0.001 0.09935 0)
					( 0.001 0.10035 0)
					( 0.001 0.098 0)
					( 0.001 0.09825 0)
					( 0.001 0.0985 0)
					( 0.001 0.09875 0)
					( 0.001 0.099 0)
					( 0.001 0.09925 0)
					( 0.001 0.0995 0)
					( 0.001 0.09975 0)
					( 0.001 0.1 0)
					( 0.001 0.10025 0)
					( 0.001 0.1005 0)

				);


