OF4.0/tutorials/oscillatorySheetFlow/system/sampleProbeUx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type probes;
 
	libs ("libsampling.so");

	interpolationScheme cellPointFace; 

	setFormat       gnuplot;

fields
(
	Ux
);

probeLocations	( 
					(0.001 0.45  0)
				);


