OF4.0/tutorials/oscillatorySheetFlow/system/sampleProfileAlpha
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets; 

libs ("libsampling.so");

interpolationScheme cellPoint;
 
setFormat       raw;


	fields
	(
	    alpha.sand
	);

sets (
	    lineX1
	    {
			type        midPoint;
			axis        y;
			start       (0.001 0  0);
			end         (0.001 0.5  0);
			//nPoints     1000;
   		}
	);




